In [5]:
import pandas as pd
df=pd.read_csv("https://media-doselect.s3.amazonaws.com/generic/X0kvr3wEYXRzONE5W37xWWYYA/test.csv")

In [37]:
to_omit = ['PassengerId', 'Pclass', 'Name', 'Sex','Embarked']
df1=df[df.columns[~df.columns.isin(['PassengerId', 'Pclass', 'Name', 'Sex','Embarked'])]]
print(df1.loc[:, sorted(list(df1.columns))].head())

    Age Cabin     Fare  Parch  SibSp   Ticket
0  34.5   NaN   7.8292      0      0   330911
1  47.0   NaN   7.0000      0      1   363272
2  62.0   NaN   9.6875      0      0   240276
3  27.0   NaN   8.6625      0      0   315154
4  22.0   NaN  12.2875      1      1  3101298

In [34]:
sorted(list(df1.columns))

['Age', 'Cabin', 'Fare', 'Parch', 'SibSp', 'Ticket']

# to extract columns excluding few columns

In [31]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# argrelextrema

In [2]:

import numpy as np

input_list = [3,8,99,9,7,4,3,77,0,2,3,4,5]
diffArray=np.diff(np.sign(np.diff(input_list)))
maximas=list(np.where(diffArray == -2)[0] + 1)
maximas=[int(x) for x in maximas]
print(maximas)
#below is an alternate approach
#from scipy.signal import argrelextrema
#maximas=argrelextrema(ser.values, np.greater)[0]

[2, 7]

In [3]:
np.diff(input_list)

array([  5,  91, -90,  -2,  -3,  -1,  74, -77,   2,   1,   1,   1])

In [8]:
np.sign(np.diff(input_list))

array([ 1,  1, -1, -1, -1, -1,  1, -1,  1,  1,  1,  1])

In [9]:
np.diff(np.sign(np.diff(input_list)))

array([ 0, -2,  0,  0,  0,  2, -2,  2,  0,  0,  0])

### Exchange the position of columns

In [6]:
For a given list of columns, exchange tehir positions with each other

In [14]:
import pandas as pd 
df=pd.read_csv("https://media-doselect.s3.amazonaws.com/generic/BgyRrKq0xex8B0N3GJxbXv5WZ/test.csv")
pd.options.display.max_columns = 100
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [20]:
df.columns.get_loc(col1)

3

In [15]:
col1=input()
col2=input()
col_list=list(df.columns)
col_list[df.columns.get_loc(col1)],col_list[df.columns.get_loc(col2)]=col_list[df.columns.get_loc(col2)],col_list[df.columns.get_loc(col1)]
exdf=df[col_list]

 Sex
 Name

In [16]:
df.head()
print(exdf.head(3))

   PassengerId  Pclass     Sex                              Name   Age  SibSp  \
0          892       3    male                  Kelly, Mr. James  34.5      0
1          893       3  female  Wilkes, Mrs. James (Ellen Needs)  47.0      1
2          894       2    male         Myles, Mr. Thomas Francis  62.0      0

   Parch  Ticket    Fare Cabin Embarked
0      0  330911  7.8292   NaN        Q
1      0  363272  7.0000   NaN        S
2      0  240276  9.6875   NaN        Q

## Get location or index of columns

In [19]:
df.columns.get_loc("Sex")

3

In [21]:
collist=list(df.columns)
collist[df.columns.get_loc("Sex")],collist[df.columns.get_loc("Embarked")]=collist[df.columns.get_loc("Embarked")],collist[df.columns.get_loc("Sex")]
exd=df[collist]
exd.head()

,PassengerId,Pclass,Name,Embarked,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex
0,892,3,"Kelly, Mr. James",Q,34.5,0,0,330911,7.8292,NaN,male
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",S,47.0,1,0,363272,7.0000,NaN,female
2,894,2,"Myles, Mr. Thomas Francis",Q,62.0,0,0,240276,9.6875,NaN,male
3,895,3,"Wirz, Mr. Albert",S,27.0,0,0,315154,8.6625,NaN,male
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",S,22.0,1,1,3101298,12.2875,NaN,female

In [10]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [11]:
#for specific columns for which we can substitute manually
newdf=df.loc[:,['PassengerId', 'Pclass','Sex','Name', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked']]
newdf.head()

,PassengerId,Pclass,Sex,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,male,"Kelly, Mr. James",34.5,0,0,330911,7.8292,NaN,Q
1,893,3,female,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,363272,7.0000,NaN,S
2,894,2,male,"Myles, Mr. Thomas Francis",62.0,0,0,240276,9.6875,NaN,Q
3,895,3,male,"Wirz, Mr. Albert",27.0,0,0,315154,8.6625,NaN,S
4,896,3,female,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,3101298,12.2875,NaN,S

In [ ]:

Q1:
Dataframe from lists
You are given a list where the first sub-list contains the column name and the following sub-lists each represent a row.
Create a pandas dataframe using this list and print summary stats (df.describe()) for the resultant dataframe.
Note that the first sub-list will have column names.
Note: Data type of all columns should stay as int.
Sample Input:
[['c1','c2','c3'],[1,2,3],[4,5,6],[7,8,9]]
Sample Output:

In [1]:
#Sample Input:
input_list=[['c1','c2','c3'],[1,2,3],[4,5,6],[7,8,9]]

In [2]:
cols=input_list.pop(0)
cols

['c1', 'c2', 'c3']

In [3]:
input_list

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [6]:
#Sample Input:
input_list=[['c1','c2','c3'],[1,2,3],[4,5,6],[7,8,9]]
cols=input_list.pop(0)
dfcol = pd.DataFrame(input_list, columns = cols)
print(dfcol.head())

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9

In [ ]:
or

In [54]:
input_list=[['c1','c2','c3'],[1,2,3],[4,5,6],[7,8,9]]

newdf=pd.DataFrame(data=[input_list[1],input_list[2],input_list[3]],columns=input_list[0])
print(newdf.head())

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9


(Case-insensitive) Longest substring
Given a string, you have to find the longest substring in alphabetical order where the string can have both lowercase and uppercase characters.
i.e. 'Ab' can be considered to be in alphabetical order.
Note: If there are two such substrings then you should print the substring starting at a lower index. (For example: in the string "here123were23we", you should print "here".
Sample Input:
AbCddfsdf
Sample Output:
AbCddfs

In [58]:
string=input()
prevChar = ""
curr_longest = ""
longest = ""

for char in string:
    if (prevChar.lower()<=char.lower()):
        curr_longest += char
        if len(curr_longest) > len(longest):
            longest= curr_longest
    else:
        curr_longest = char
    prevChar = char
print( longest )

 SKjheorigYTHgHFCDhtJHG

CDht

## group by certain column values

In [ ]:
##Find group
Description
Given a dataframe, you have to group it by given column name(list of column names). After that you should print data of the group with a specified column value(values). 
The input will contain two lines. First line will have a list of columns and second will have a list of values.
The output should have the first five rows of the corresponding group.(there can be less than five rows in a group too)

In [9]:
## incorrect approach
print(df[(df["Pclass"]==3) & (df["Age"]==13)])
g=df.groupby(["Pclass","Age"])
n=g.get_group((3,13))
n.head()

     PassengerId  Pclass                           Name   Sex   Age  SibSp  \
154         1046       3   Asplund, Master. Filip Oscar  male  13.0      4
392         1284       3  Abbott, Master. Eugene Joseph  male  13.0      0

     Parch     Ticket     Fare Cabin Embarked
154      2     347077  31.3875   NaN        S
392      2  C.A. 2673  20.2500   NaN        S

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
154,1046,3,"Asplund, Master. Filip Oscar",male,13.0,4,2,347077,31.3875,NaN,S
392,1284,3,"Abbott, Master. Eugene Joseph",male,13.0,0,2,C.A. 2673,20.2500,NaN,S

In [8]:
import pandas as pd 
input_list = [['Pclass','Age'],[3,13]]
cols=input_list[0]
values=input_list[1]
df=pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/wkyk2AWYdJbqgXoRo3Y8w42nX/test.csv')
print(df.groupby(cols).get_group(tuple(values)).head())

     PassengerId  Pclass                           Name   Sex   Age  SibSp  \
154         1046       3   Asplund, Master. Filip Oscar  male  13.0      4
392         1284       3  Abbott, Master. Eugene Joseph  male  13.0      0

     Parch     Ticket     Fare Cabin Embarked
154      2     347077  31.3875   NaN        S
392      2  C.A. 2673  20.2500   NaN        S

In [ ]:
Q:5
Groupby
Description
Given a dataframe, you have to group it by all non-numeric columns(numeric columns would be float and int) and print the resulting dataframe aggregated by averages.
The input will contain URL of a dataframe. The output should be first five rows of the resultant dataframe after the groupby operation.

read this as input:
"https://media-doselect.s3.amazonaws.com/generic/E4QbGd18ORJpbZZkndZ5bdKBn/googleplaystore_user_reviews.csv"

In [1]:
import pandas as pd 

df=pd.read_csv("https://media-doselect.s3.amazonaws.com/generic/E4QbGd18ORJpbZZkndZ5bdKBn/googleplaystore_user_reviews.csv")
numerics = ['int16', 'int32', 'int64', 'float16', 'float32', 'float64']
cols = list(df.select_dtypes(exclude=numerics).columns)
print(df.groupby(cols).agg('mean').head())

                                                                        Sentiment_Polarity  \
App                   Translated_Review                      Sentiment
10 Best Foods for You 10 best foods 4u Excellent chose foods Positive                 1.00
                      A big thanks ds I got bst gd health    Positive                 0.10
                      Absolutely Fabulous Phenomenal         Positive                 0.45
                      Amazing                                Positive                 0.60
                      An excellent A useful                  Positive                 0.65

                                                                        Sentiment_Subjectivity
App                   Translated_Review                      Sentiment
10 Best Foods for You 10 best foods 4u Excellent chose foods Positive                     0.65
                      A big thanks ds I got bst gd health    Positive                     0.15
                      Absolutely Fabulous Phenomenal         Positive                     0.75
                      Amazing                                Positive                     0.90
                      An excellent A useful                  Positive                     0.50

In [ ]:

Gambling 101
You are participating in a lottery game. A deck of cards numbered from 1-50 is shuffled and 5 cards are drawn out and laid out. You are given a coin.
For each card, you toss the coin and pick it up if it says heads, otherwise you don't pick it up. The sum of the cards is what you win.
The lottery ticket costs c rupees. If the expected value of the sum of cards you pick up is less than the lottery ticket, 
then you buy another ticket otherwise you don't.

Input Format:
The first 5 lines of the input will contain 5 numbers between 1 to 50.
The next line will contain c, the cost of lottery ticket.
Output Format:
Print "Don't buy another" if the expected value is less than the ticket price and print "Buy another one" if the expected value is more than the ticket price.

Sample Input:
1
4
6
17
3
23
Sample Output:
Don't buy another

In [ ]:
sum=0
for i in range(0,5):
    sum=sum+int(input())/2
if sum<=int(input()):
    print("Don't buy another")
else:
    print("Buy another one")

In [ ]:
ev=0
for i in range(0,5):
    n = int(input(range(1,51)))
    ev=ev+0.5*n
    i=i+1
if ev<int(input("Enter lottery ticket price c\n")):
    print("Buy another one")
else:
    print("Don't buy another")

Question 2
Generating normal distribution
Generate an array of real numbers representing a normal distribution. You will be given the mean and standard deviation as input. You have to generate 10 such numbers.
Hint: You can use numpy's np.random here.  You can read more about it here.
To keep the output consistent, you have to set the seed as a specific number which will be given to you as input. Setting a seed means that every time you generate random numbers, they will be the same for the same seed. You can read more about it here.

Input Format:
The input will contain 3 lines which have the seed, mean and standard deviation of the distribution in the same order.
The output will be a numpy array of the generated normal distribution.

Sample Input:
1
0
0.1

In [3]:
import numpy as np 
seed=int(input())
mean=float(input())
std_dev=float(input())
np.random.seed(seed)
s = np.random.normal(mean, std_dev, 10)
print(s)

 10
 25
 5

[31.65793252 28.57639487 17.27299854 24.95808075 28.10667987 21.3995722
 26.32755793 25.54274263 25.02145715 24.12699895]

question3
Confidence Intervals
For a given column in a dataframe, you have to calculate the 90 percent confidence interval for its mean value. (You can find Z* value for 90 percent confidence from previous segments) 
The input will have the column name. 
The output should have the confidence interval printed as a tuple.
Note: Do not use the inbuilt function via statmodels.api or any other libraries. You should write the code on your own to get accurate answers.
The confidence interval values have to be approximated up to two decimal places.
Sample Input:
GRE Score

In [ ]:
import pandas as pd 
import numpy as np
df=pd.read_csv("https://media-doselect.s3.amazonaws.com/generic/N9LKLvBAx1y14PLoBdL0yRn3/Admission_Predict.csv")
col=input()
mean = df[col].mean()
sd = df[col].std()
n = len(df)
Zstar=1.65
se = sd/np.sqrt(n)
lcb = mean - Zstar * se
ucb = mean + Zstar * se
print((round(lcb,2),round(ucb,2)))

#via statmodels.api you can do this as follows:
#import statsmodels.api as sm
#sm.stats.DescrStatsW(df[col]).zconfint_mean()

Question 4
College admissions
The probability that a college will accept a student's application is x.
Consider that m students have applied to college. You have to find the probability that at most n students are accepted by the college.
The input will contain three lines with x, m and n respectively.
The output should be rounded off to four decimal places.
Sample Input:
0.3
5
2
Sample Output:
0.8369

In [ ]:
import scipy.stats as ss
x=float(input())
m=int(input())
n=int(input())
dist=ss.binom(m,x)
sum=0.0
for i in range(0,n+1):
    sum=sum+dist.pmf(i)
print(round(sum,4))

Question 5
Tossing a coin
Given that you are tossing a coin n times, you have to find the probability of getting heads at most m times.
The input will have two lines containing n and m respectively.
Sample Input:
10
2
Sample Output:
0.0547

In [ ]:
import scipy.stats as ss
n=int(input())#number of trials
m=int(input())# find the probability of getting at most m heads
dist=ss.binom(n,0.5)
sum=0.0
for i in range(0,m+1):
    sum=sum+dist.pmf(i)
print(round(sum,4))
#you can also use the following
#round(dist.cdf(m),2)

Question 6
Combination Theory
You are given a list of n natural numbers. You select m numbers from the list at random. 
Find the probability that at least one of the selected alphabets is "x" where x is a number given to you as input.
The first line of input will contain a list of numbers. The second line will contain m and the third line will contain x.
The output should be printed out as float.
Sample Input:
[1,2,3,4,5,6,6,6,6,7,7,7]
3
6

In [ ]:
import ast,sys
input_str = sys.stdin.read()
input_list = ast.literal_eval(input_str)
nums=input_list[0]
m=int(input_list[1])#m numbers are chosen
x=int(input_list[2])#find probability of getting at least one x 
from itertools import combinations 
num = 0
den = 0
for c in combinations(nums,m):
    den=den+1
    if x in c:
        num=num+1
    
print (float(num)/den)

Question 7
Rolling the dice
A die is rolled n times. You have to find the probability that a number i is rolled at least j times(up to four decimal places)
The input will contain the integers n, i and j in three lines respectively. You can assume that j<n and 0<i<7.
The output should be rounded off to four decimal places.
Sample Input:
4
1
2
Sample Output:
0.1319

In [ ]:
import scipy.stats as ss
n=int(input())
i=int(input())
j=int(input())
dist=ss.binom(n,1/6)
print(round(1-dist.cdf(j-1),4))

# probabiility of atleast once= 1-prob of none
#probability of at least j(j or more than j upto n trials) = 1-(less than j i.e. prob of j-1)
# which can be 1-dist.cdf(j-1),rounded to 4 places)


Lego Stack
You are given a row of Lego Blocks consisting of n blocks. All the blocks given have a square base whose side length is known. You need to stack the blocks over each other and create a vertical tower. Block-1 can go over Block-2 only if sideLength(Block-2)=>sideLength(Block-1).
From the row of Lego blocks, you on only pick up either the leftmost or rightmost block.
Print "Possible" if it is possible to stack all n cubes this way or else print "Impossible".

Input Format:
The input will contain a list of n integers representing the side length of each block's base in the row starting from the leftmost.

Sample Input:
[5 ,4, 2, 1, 4 ,5]
Sample Output:
Possible

In [ ]:
import ast,sys
input_str = sys.stdin.read()
sides = ast.literal_eval(input_str)#list of side lengths
l=len(sides)
diff = [(sides[i]-sides[i+1]) for i in range(l-1)]
i = 0 
while (i<l-1 and diff[i]>=0) : i += 1 
while (i<l-1 and diff[i]<=0) : i += 1
if (i==l-1) : print("Possible") 
else : print("Impossible")

#to understand the code, try printing out all intermediate variables.